---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NoPlane
source: html/874485bd-6499-ba8c-f10b-331f0ac0e73e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NoPlane Property

Highlighted geometry no longer determines a plane

## Syntax (C#)
```csharp
public static FailureDefinitionId NoPlane { get; }
```